---
kind: other
id: Methods.T:Autodesk.Revit.DB.MeshFromGeometryOperationResult
source: html/bcd7c039-bc37-a899-db95-c200632db0b0.htm
---
# MeshFromGeometryOperationResult Methods

Returns the array of issues encountered while building a mesh.